// Lab_03_1.cpp
// <Менчинський Артем>
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 22

#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    double x;  // вхідний параметр
    double y1, y2;  // результати обчислення виразу для двох способів
    double A;  // проміжний результат - функціонально стала частина виразу
    double B;  // проміжний результат - функціонально змінна частина виразу

    // Введення значення x
    cout << "x = "; cin >> x;

    // Спільна частина обчислень
    A = x * x * x;  // обчислюємо куб від x

    // *** Спосіб 1: розгалуження в скороченій формі ***
    if (x < -1) {
        B = abs(2 + x) + pow(sin(x), 2);
    }
    else if (-1 <= x && x <= 1) {
        B = atan(x * x * x + 1) + 1;
    }
    else if (x > 1) {
        B = exp(cos(x)) + log(1 / x + 1);
    }

    y1 = A + B;

    // Виведення результату за першим способом
    cout << "1) y = " << y1 << "way 1" << endl;

    // *** Спосіб 2: розгалуження в повній формі ***
    if (x < -1) {
        B = abs(2 + x) + pow(sin(x), 2);
    }
    else {
        if (-1 <= x && x <= 1) {
            B = atan(x * x * x + 1) + 1;
        }
        else {
            B = exp(cos(x)) + log(1 / x + 1);
        }
    }

    y2 = A + B;

    // Виведення результату за другим способом
    cout << "2) y = " << y2 << " (way 2)" << endl;

    return 0;
}
